PlaceHolder_Matome0/backend/lib/tasks/generate_news.rake

SELECT "map_tiles".* FROM "map_tiles"
---
  task run: :environment do
    Rails.logger.info "News generation task executed at #{Time.now}"

    # 環境変数からキーのパスを取得
    api_key_path = ENV["OPENAI_API_KEY_PATH"]
    # ファイルからAPIキーを読み取る
    api_key = File.read(api_key_path).strip
    client = OpenAI::Client.new(api_key: api_key)

    # ファイル読み込み
    prompt_text = File.read(Rails.root.join("prompts", "generate_news_prompt.txt"))
    background = File.read(Rails.root.join("prompts", "world", "background.txt"))

    # MapTile テーブルから全マスのデータを取得してJSON化
    map_data = MapTile.all.map do |tile|

INSERT INTO "articles" ("title", "slug", "status", "author", "published_at", "digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---

    # 結果の整形とDB登録
    json = JSON.parse(response.dig("choices", 0, "message", "content"))
    Article.create!(
      title: json["title"],
      digest: json["digest"],
      author: json["author"],
      slug: json["title"].parameterize,
      published_at: Time.current,
      status: "published"
    )