PlaceHolder_Matome0/backend/app/controllers/api/v1/articles_controller.rb

      def index
        @articles = Article.includes(:article_metadata, :discussion, :article_categories).all
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."article_id" IN ($1, $2, $3)  [["article_id", 1], ["article_id", 2], ["article_id", 3]]