PlaceHolder_Matome0/backend/app/controllers/api/v1/articles_controller.rb

      def index
        @articles = Article.includes([
          :article_metadata,
          :article_categories,
          { discussion: :discussion_messages }
        ]).all
---
SELECT "article_categories".* FROM "article_categories" WHERE "article_categories"."article_id" IN ($1, $2, $3)  [["article_id", 1], ["article_id", 2], ["article_id", 3]]
SELECT "article_metadata".* FROM "article_metadata" WHERE "article_metadata"."article_id" IN ($1, $2, $3)  [["article_id", 1], ["article_id", 2], ["article_id", 3]]
SELECT "articles".* FROM "articles"
SELECT "discussion_messages".* FROM "discussion_messages" WHERE "discussion_messages"."discussion_id" IN ($1, $2, $3)  [["discussion_id", 1], ["discussion_id", 2], ["discussion_id", 3]]